app/Controllers/User/Auth.php

    public function forgotPassword()
    {
        if (session()->get('isUserLoggedIn')) {
            return redirect()->to('user/dashboard');
        }

        if ($this->request->getMethod() === 'POST') {
            $rules = [
                'phone' => [
                    'label' => 'Phone Number',
                    'rules' => 'required|numeric|min_length[10]|max_length[10]|is_not_unique[users.phone]',
                    'errors' => [
                        'required' => 'Please enter your phone number.',
                        'numeric' => 'The phone number must contain only digits.',
                        'is_not_unique' => 'This phone number is not registered in our system.',
                        'min_length' => 'Mobile no is not valid',
                        'max_length' => 'Mobile no is not valid',
                    ]
                ]
            ];

            if (!$this->validate($rules)) {
                return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
            } else {
                $userModel = new UserModel();
                $phone = $this->request->getPost('phone');

                $user = $userModel->where('phone', $phone)->first();
---
SELECT *
FROM `users`
WHERE `phone` = '9099147236'
 LIMIT 1

                        $otp = rand(1000, 9999);

                        if ($sms->sendOtp($phone, $otp)) {
                            $userModel->update($user['id'], [
                                'otp_code' => $otp,
                                'otp_expires_at' => date('Y-m-d H:i:s', strtotime('+5 minutes')),
                                'pwd_date' => date('Y-m-d'),
                                'pwd_count' => (isset($user['pwd_count']) && $user['pwd_count'] != '' && date('Y-m-d') == $user['pwd_date']) ? ($user['pwd_count'] + 1) : 1,
                            ]);
---
UPDATE `users` SET `otp_code` = 3171, `otp_expires_at` = '2026-01-19 12:47:35', `pwd_date` = '2026-01-19', `pwd_count` = 3, `updated_at` = '2026-01-19 12:42:35'
WHERE `users`.`id` IN ('1')