app/Controllers/Home.php

    public function index(): string
    {
        $productModel = new ProductModel();
        $data['product'] = $productModel->where('status', 'active')->first();
---
SELECT *
FROM `products`
WHERE `status` = 'active'
 LIMIT 1